<template>
    <div>
        <DefaultArticle :content="{link:this.link, kiji:kiji}"/>
    </div>
</template>


<script>

const DefaultArticle = () => import('~/components/default-article.vue');
import marked from 'marked';

export default{
    data: function() {
        return {
            link: "step1",
            prekiji:
`
## GitHubとは

　バージョン管理システムの__「Git」__を利用して、ソフトウェア開発プロジェクトのソースコードを管理・共有することができる __Webサービスプラットフォーム__ のこと。Ruby on RailsおよびErlangで記述されている。利用するには、アカウントの作成が必要になり、基本的機能は無料で使う事ができる。ローカル環境の「Git」で作成した __"ローカルリポジトリ"__ と「GitHub」の __"リモートリポジトリ"__ を送受信してソースコードのバージョン管理をするのが基本。リモートだけでも完結できる。

## 何が嬉しいか

　私が考える主なメリットとして、__WEB上で__・__複数人で__・__簡単に__ プログラムコードを管理できるという点を挙げたい。
主に__「Git」__の恩恵であるが、例えば、以下に記述するのは、__バージョン管理システム(VCS)__ についての説明である:

> バージョン管理システムの最も基本的な機能は、__ファイルの作成日時、変更日時、変更点などの履歴を保管する__ことである。
これにより、何度も__変更を加えたファイル__であっても、__過去の状態や変更内容を確認__したり、__変更前の状態を復元__することが容易になる。
更に、多くのバージョン管理システムでは、__複数の人間__がファイルの編集に関わる状況を想定している。
商業的なソフトウェア開発やオープンソースプロジェクトなどでは、複数の人間が複数のファイルを各々編集するため、
それぞれのファイルの__最新の状態が分からなくなったり、同一ファイルに対する変更が競合する__などの問題が生じやすいが、
__バージョン管理システムは、このような問題を解決する仕組みを提供する__。
ただし、バージョン管理システムを個人のファイル管理に使用することも可能であるし、
ソフトウェアのソースコードだけでなく、設定ファイルや原稿の管理などにも使うことも可能である。


要するに安全性と効率性の重点的機能であるといえる。

　そしてこの「GitHub」というプラットフォームは非常に知名度が高く、また利用者も断トツで多いという現状がある。
使い勝手も分かっている人が多く、故に迅速な開発のスタートが可能となりやすい。
また、初学者やコマンドラインでの操作にまだ自信がない人にも、
操作の指示性が高く、直感的にわかりやすいUI/UXを提供している。

　自然に明らかだが、エンジニアの開発現場では、殆どの場合でこういったサービスが導入されている。
エンジニア志望の方には、絶対必須の知識として知っておいてもらいたい。

　またGitHubには、各プロジェクトに__wiki(メモ書き)__や__タスク管理ツール__など、
コラボレーションのための機能も充実している。
個人的におすすめの機能として、__「GitHub Pages」__という無料の静的ウェブページのためのウェブホスティングサービスがある。
WordPressの時代は終わりを告げた。

## アカウント登録

　登録の仕方は非常に簡単で、以下の手順で行う

1.  GItHubの公式サイト [https://github.com](https://github.com/) にアクセスして、アカウント登録。

<center><img alt="" src="/github1.png"></img></center>

ユーザー名、メールアドレス、パスワードを決めて __Sign Up__ する。

2. メールアドレス宛に認証メールが送られてくるので、リンクにアクセスして認証する。

3. 有料プランか無料プランを選択。無料プランでオッケー。

4. 実際にログインしてみる。

## 終わり

　この通り簡単なのでぜひやってみてほしい。取り敢えず作って見るだけでもオッケー。
絶対に将来役に立つはずであると信じている。
`
        }
    },
    computed: {
        kiji() {
            if (!process.client) console.log(this.prekiji.length);
            return marked(this.prekiji);
        },
    },
    components: {
        DefaultArticle
    },
}

</script>
