<template>
    <div>
        <DefaultArticle :content="{link:this.link, prekiji:this.prekiji}"/>
    </div>
</template>


<script>

import DefaultArticle from '~/components/default-article.vue';

export default{
    data: function() {
        return {
            link: "step1",
            prekiji:
`
## GitHubとは

　バージョン管理システムの__「Git」__を利用して、ソフトウェア開発プロジェクトのソースコードを管理・共有することができる __Webサービス__ のこと。利用するには、アカウントの作成が必要になり、基本的機能は無料で使う事ができる。ローカル環境の「Git」で作成した __"ローカルリポジトリ"__ と「GitHub」の __"リモートリポジトリ"__ を送受信してソースコードのバージョン管理をするのが基本。リモートだけでも完結できる。

## 何が嬉しいか

　__WEB上で__ __複数人で__ プログラムコードを管理できる。
以下はバージョン管理システム(VCS)の要件:
\`\`\`text
本来従来のやり方に於いては、複数の人間が複数のファイルを各々編集するため、
それぞれのファイルの最新の状態が分からなくなったり、
同一ファイルに対する変更が競合するなどの問題が生じやすいが、
バージョン管理システム(VCS)は、このような問題を解決する仕組みを提供する。
そして、ファイルの作成日時、変更日時、変更点などの履歴を保管する機能である。
これにより、何度も変更を加えたファイルであっても、過去の状態や変更内容を確認したり、
変更前の状態を復元することが容易になる。
\`\`\`

　これはつまり、開発プロジェクトにはもってこいなわけで、
エンジニアの現場では、殆どの場合、開発環境でこういったサービスが導入されている。
エンジニア志望の学生の方には、絶対必須の知識として知っておいてもらいたい。
また、各プロジェクトにwiki(メモ書き)やタスク管理ツールなど、
コラボレーションのための機能も充実している。

## アカウント登録

　登録の仕方は非常に簡単で、以下の手順で行う

1.  GItHubの公式サイト [https://github.com](https://github.com/) にアクセスして、アカウント登録します。

<center><img alt="" src="/github1.png"></img></center>

ユーザー名、メールアドレス、パスワードを決めて __Sign Up__ する。

2. メールアドレス宛に認証メールが送られてくるので、リンクにアクセスして認証する。

3. 有料プランか無料プランを選択。無料プランでオッケー。

4. 実際にログインしてみましょう。

## 終わり

　この通り簡単なのでぜひやってみてください。取り敢えず作って見るだけでもいいんですよ。
`
        }
    },
    components: {
        DefaultArticle
    },
}

</script>
