<template>
    <div>
        <DefaultArticle :content="{link:this.link, kiji:kiji}"/>
    </div>
</template>


<script>

const DefaultArticle = () => import('~/components/default-article.vue');
import marked from 'marked';

export default{
    data: function() {
        return {
            link: "step1",
            prekiji:
`
## GitHubとは

　Web上で公開されている、基本的に利用が__無料で可能__な、簡単に言う慣れば、__ソフトウエアの管理サービス__のこと。__GitのVCS(バージョン管理システム)機能__を備えている。
プログラムを書く人ならば一度は耳にしたことがあると思う。
オープンソフトウェアの開発等、__複数人で管理__するのに利点がある。
故に実際に、OSSの管理や開発はこれを使って行われていることが多い。
だがOSSのプロジェクトに限らず、個人あるいは企業が、これを採用するのは推奨されることで、
なぜならば、使うのと使わないのでは、段違いに開発効率が変わる。
他にもGitを備えたサービスはあるが、私はいつもこれを使っている。

## 何が嬉しいか

　私が考える主なメリットとして、__WEB上で__・__複数人で__・__簡単に__ プログラムコードを管理できるという点を挙げたい。
主に__「Git」__の恩恵であるが、例えば、以下に記述するのは、__バージョン管理システム(VCS)__ についての説明である:

> VCSの最も基本的な機能としてあげられるもの、それは、__ファイルの変更に関しての情報を保管する__ことである。
つまりこの機能より、変更をしてしまったファイルに関して、以前のファイル状態を参照して、__以前の状態にファイルをを復元__することが可能。
更に、殆どの場合VCSにおいて、__複数人__でファイルを管理することを考慮する。
企業などの製品開発、OSSのプロジェクトに関しては、勿論複数人がファイルを管理することになるが、
従来であれば、編集していたファイルと部分が衝突して、ごちゃごちゃになったり、
ファイルの最新バージョンがどれなのか判断しにくかったりした。
これらような問題はVCSにおいて生じない。
また、個人開発に採用される場合においても、否定されるような仕組みではない。

要するに安全性と効率性の重点的機能であるといえる。

　そしてこの「GitHub」というプラットフォームは非常に知名度が高く、また利用者も断トツで多いという現状がある。
使い勝手も分かっている人が多く、故に迅速な開発のスタートが可能となりやすい。
また、初学者やコマンドラインでの操作にまだ自信がない人にも、
操作の指示性が高く、直感的にわかりやすいUI/UXを提供している。

　自然に明らかだが、エンジニアの開発現場では、殆どの場合でこういったサービスが導入されている。
エンジニア志望の方には、絶対必須の知識として知っておいてもらいたい。

　またGitHubには、より多くの複数人開発に有利な機能を提供する。
個人的におすすめの機能として、__「GitHub Pages」__という無料でウェブサイトを公開できるようなサービスがある。
WordPressの時代は終わりを告げた。

## アカウント登録

　登録の仕方は非常に簡単で、以下の手順で行う

1.  GItHubの公式サイト [https://github.com](https://github.com/) にアクセスして、アカウント登録。

<center><img alt="" src="/github1.png"></img></center>

ユーザー名、メールアドレス、パスワードを決めて __Sign Up__ する。

2. メールアドレス宛に認証メールが送られてくるので、リンクにアクセスして認証する。

3. 有料プランか無料プランを選択。無料プランでオッケー。

4. 実際にログインしてみる。

## 終わり

　この通り簡単なのでぜひやってみてほしい。取り敢えず作って見るだけでもオッケー。
絶対に将来役に立つはずであると信じている。
`
        }
    },
    computed: {
        kiji() {
            if (!process.client) console.log(this.prekiji.length);
            return marked(this.prekiji);
        },
    },
    components: {
        DefaultArticle
    },
}

</script>
